frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/flashcalw.h
/* -------- FLASHCALW_FGPFRHI : (FLASHCALW Offset: 0x14) (R/W 32) Flash Controller General Purpose Fuse Register High -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t GPF32:1;          /*!< bit:      0  General Purpose Fuse 32            */
    uint32_t GPF33:1;          /*!< bit:      1  General Purpose Fuse 33            */
    uint32_t GPF34:1;          /*!< bit:      2  General Purpose Fuse 34            */
    uint32_t GPF35:1;          /*!< bit:      3  General Purpose Fuse 35            */
    uint32_t GPF36:1;          /*!< bit:      4  General Purpose Fuse 36            */
    uint32_t GPF37:1;          /*!< bit:      5  General Purpose Fuse 37            */
    uint32_t GPF38:1;          /*!< bit:      6  General Purpose Fuse 38            */
    uint32_t GPF39:1;          /*!< bit:      7  General Purpose Fuse 39            */
    uint32_t GPF40:1;          /*!< bit:      8  General Purpose Fuse 40            */
    uint32_t GPF41:1;          /*!< bit:      9  General Purpose Fuse 41            */
    uint32_t GPF42:1;          /*!< bit:     10  General Purpose Fuse 42            */
    uint32_t GPF43:1;          /*!< bit:     11  General Purpose Fuse 43            */
    uint32_t GPF44:1;          /*!< bit:     12  General Purpose Fuse 44            */
    uint32_t GPF45:1;          /*!< bit:     13  General Purpose Fuse 45            */
    uint32_t GPF46:1;          /*!< bit:     14  General Purpose Fuse 46            */
    uint32_t GPF47:1;          /*!< bit:     15  General Purpose Fuse 47            */
    uint32_t GPF48:1;          /*!< bit:     16  General Purpose Fuse 48            */
    uint32_t GPF49:1;          /*!< bit:     17  General Purpose Fuse 49            */
    uint32_t GPF50:1;          /*!< bit:     18  General Purpose Fuse 50            */
    uint32_t GPF51:1;          /*!< bit:     19  General Purpose Fuse 51            */
    uint32_t GPF52:1;          /*!< bit:     20  General Purpose Fuse 52            */
    uint32_t GPF53:1;          /*!< bit:     21  General Purpose Fuse 53            */
    uint32_t GPF54:1;          /*!< bit:     22  General Purpose Fuse 54            */
    uint32_t GPF55:1;          /*!< bit:     23  General Purpose Fuse 55            */
    uint32_t GPF56:1;          /*!< bit:     24  General Purpose Fuse 56            */
    uint32_t GPF57:1;          /*!< bit:     25  General Purpose Fuse 57            */
    uint32_t GPF58:1;          /*!< bit:     26  General Purpose Fuse 58            */
    uint32_t GPF59:1;          /*!< bit:     27  General Purpose Fuse 59            */
    uint32_t GPF60:1;          /*!< bit:     28  General Purpose Fuse 60            */
    uint32_t GPF61:1;          /*!< bit:     29  General Purpose Fuse 61            */
    uint32_t GPF62:1;          /*!< bit:     30  General Purpose Fuse 62            */
    uint32_t GPF63:1;          /*!< bit:     31  General Purpose Fuse 63            */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} FLASHCALW_FGPFRHI_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define FLASHCALW_FGPFRHI_OFFSET    0x14         /**< \brief (FLASHCALW_FGPFRHI offset) Flash Controller General Purpose Fuse Register High */

#define FLASHCALW_FGPFRHI_GPF32_Pos 0            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 32 */
#define FLASHCALW_FGPFRHI_GPF32     (_U(0x1) << FLASHCALW_FGPFRHI_GPF32_Pos)
#define FLASHCALW_FGPFRHI_GPF33_Pos 1            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 33 */
#define FLASHCALW_FGPFRHI_GPF33     (_U(0x1) << FLASHCALW_FGPFRHI_GPF33_Pos)
#define FLASHCALW_FGPFRHI_GPF34_Pos 2            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 34 */
#define FLASHCALW_FGPFRHI_GPF34     (_U(0x1) << FLASHCALW_FGPFRHI_GPF34_Pos)
#define FLASHCALW_FGPFRHI_GPF35_Pos 3            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 35 */
#define FLASHCALW_FGPFRHI_GPF35     (_U(0x1) << FLASHCALW_FGPFRHI_GPF35_Pos)
#define FLASHCALW_FGPFRHI_GPF36_Pos 4            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 36 */
#define FLASHCALW_FGPFRHI_GPF36     (_U(0x1) << FLASHCALW_FGPFRHI_GPF36_Pos)
#define FLASHCALW_FGPFRHI_GPF37_Pos 5            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 37 */
#define FLASHCALW_FGPFRHI_GPF37     (_U(0x1) << FLASHCALW_FGPFRHI_GPF37_Pos)
#define FLASHCALW_FGPFRHI_GPF38_Pos 6            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 38 */
#define FLASHCALW_FGPFRHI_GPF38     (_U(0x1) << FLASHCALW_FGPFRHI_GPF38_Pos)
#define FLASHCALW_FGPFRHI_GPF39_Pos 7            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 39 */
#define FLASHCALW_FGPFRHI_GPF39     (_U(0x1) << FLASHCALW_FGPFRHI_GPF39_Pos)
#define FLASHCALW_FGPFRHI_GPF40_Pos 8            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 40 */
#define FLASHCALW_FGPFRHI_GPF40     (_U(0x1) << FLASHCALW_FGPFRHI_GPF40_Pos)
#define FLASHCALW_FGPFRHI_GPF41_Pos 9            /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 41 */
#define FLASHCALW_FGPFRHI_GPF41     (_U(0x1) << FLASHCALW_FGPFRHI_GPF41_Pos)
#define FLASHCALW_FGPFRHI_GPF42_Pos 10           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 42 */
#define FLASHCALW_FGPFRHI_GPF42     (_U(0x1) << FLASHCALW_FGPFRHI_GPF42_Pos)
#define FLASHCALW_FGPFRHI_GPF43_Pos 11           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 43 */
#define FLASHCALW_FGPFRHI_GPF43     (_U(0x1) << FLASHCALW_FGPFRHI_GPF43_Pos)
#define FLASHCALW_FGPFRHI_GPF44_Pos 12           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 44 */
#define FLASHCALW_FGPFRHI_GPF44     (_U(0x1) << FLASHCALW_FGPFRHI_GPF44_Pos)
#define FLASHCALW_FGPFRHI_GPF45_Pos 13           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 45 */
#define FLASHCALW_FGPFRHI_GPF45     (_U(0x1) << FLASHCALW_FGPFRHI_GPF45_Pos)
#define FLASHCALW_FGPFRHI_GPF46_Pos 14           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 46 */
#define FLASHCALW_FGPFRHI_GPF46     (_U(0x1) << FLASHCALW_FGPFRHI_GPF46_Pos)
#define FLASHCALW_FGPFRHI_GPF47_Pos 15           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 47 */
#define FLASHCALW_FGPFRHI_GPF47     (_U(0x1) << FLASHCALW_FGPFRHI_GPF47_Pos)
#define FLASHCALW_FGPFRHI_GPF48_Pos 16           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 48 */
#define FLASHCALW_FGPFRHI_GPF48     (_U(0x1) << FLASHCALW_FGPFRHI_GPF48_Pos)
#define FLASHCALW_FGPFRHI_GPF49_Pos 17           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 49 */
#define FLASHCALW_FGPFRHI_GPF49     (_U(0x1) << FLASHCALW_FGPFRHI_GPF49_Pos)
#define FLASHCALW_FGPFRHI_GPF50_Pos 18           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 50 */
#define FLASHCALW_FGPFRHI_GPF50     (_U(0x1) << FLASHCALW_FGPFRHI_GPF50_Pos)
#define FLASHCALW_FGPFRHI_GPF51_Pos 19           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 51 */
#define FLASHCALW_FGPFRHI_GPF51     (_U(0x1) << FLASHCALW_FGPFRHI_GPF51_Pos)
#define FLASHCALW_FGPFRHI_GPF52_Pos 20           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 52 */
#define FLASHCALW_FGPFRHI_GPF52     (_U(0x1) << FLASHCALW_FGPFRHI_GPF52_Pos)
#define FLASHCALW_FGPFRHI_GPF53_Pos 21           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 53 */
#define FLASHCALW_FGPFRHI_GPF53     (_U(0x1) << FLASHCALW_FGPFRHI_GPF53_Pos)
#define FLASHCALW_FGPFRHI_GPF54_Pos 22           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 54 */
#define FLASHCALW_FGPFRHI_GPF54     (_U(0x1) << FLASHCALW_FGPFRHI_GPF54_Pos)
#define FLASHCALW_FGPFRHI_GPF55_Pos 23           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 55 */
#define FLASHCALW_FGPFRHI_GPF55     (_U(0x1) << FLASHCALW_FGPFRHI_GPF55_Pos)
#define FLASHCALW_FGPFRHI_GPF56_Pos 24           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 56 */
#define FLASHCALW_FGPFRHI_GPF56     (_U(0x1) << FLASHCALW_FGPFRHI_GPF56_Pos)
#define FLASHCALW_FGPFRHI_GPF57_Pos 25           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 57 */
#define FLASHCALW_FGPFRHI_GPF57     (_U(0x1) << FLASHCALW_FGPFRHI_GPF57_Pos)
#define FLASHCALW_FGPFRHI_GPF58_Pos 26           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 58 */
#define FLASHCALW_FGPFRHI_GPF58     (_U(0x1) << FLASHCALW_FGPFRHI_GPF58_Pos)
#define FLASHCALW_FGPFRHI_GPF59_Pos 27           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 59 */
#define FLASHCALW_FGPFRHI_GPF59     (_U(0x1) << FLASHCALW_FGPFRHI_GPF59_Pos)
#define FLASHCALW_FGPFRHI_GPF60_Pos 28           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 60 */
#define FLASHCALW_FGPFRHI_GPF60     (_U(0x1) << FLASHCALW_FGPFRHI_GPF60_Pos)
#define FLASHCALW_FGPFRHI_GPF61_Pos 29           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 61 */
#define FLASHCALW_FGPFRHI_GPF61     (_U(0x1) << FLASHCALW_FGPFRHI_GPF61_Pos)
#define FLASHCALW_FGPFRHI_GPF62_Pos 30           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 62 */
#define FLASHCALW_FGPFRHI_GPF62     (_U(0x1) << FLASHCALW_FGPFRHI_GPF62_Pos)
#define FLASHCALW_FGPFRHI_GPF63_Pos 31           /**< \brief (FLASHCALW_FGPFRHI) General Purpose Fuse 63 */
#define FLASHCALW_FGPFRHI_GPF63     (_U(0x1) << FLASHCALW_FGPFRHI_GPF63_Pos)
#define FLASHCALW_FGPFRHI_MASK      _U(0xFFFFFFFF) /**< \brief (FLASHCALW_FGPFRHI) MASK Register */

/* -------- FLASHCALW_FGPFRLO : (FLASHCALW Offset: 0x18) (R/W 32) Flash Controller General Purpose Fuse Register Low -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t LOCK0:1;          /*!< bit:      0  Lock Bit 0                         */
    uint32_t LOCK1:1;          /*!< bit:      1  Lock Bit 1                         */
    uint32_t LOCK2:1;          /*!< bit:      2  Lock Bit 2                         */
    uint32_t LOCK3:1;          /*!< bit:      3  Lock Bit 3                         */
    uint32_t LOCK4:1;          /*!< bit:      4  Lock Bit 4                         */
    uint32_t LOCK5:1;          /*!< bit:      5  Lock Bit 5                         */
    uint32_t LOCK6:1;          /*!< bit:      6  Lock Bit 6                         */
    uint32_t LOCK7:1;          /*!< bit:      7  Lock Bit 7                         */
    uint32_t LOCK8:1;          /*!< bit:      8  Lock Bit 8                         */
    uint32_t LOCK9:1;          /*!< bit:      9  Lock Bit 9                         */
    uint32_t LOCK10:1;         /*!< bit:     10  Lock Bit 10                        */
    uint32_t LOCK11:1;         /*!< bit:     11  Lock Bit 11                        */
    uint32_t LOCK12:1;         /*!< bit:     12  Lock Bit 12                        */
    uint32_t LOCK13:1;         /*!< bit:     13  Lock Bit 13                        */
    uint32_t LOCK14:1;         /*!< bit:     14  Lock Bit 14                        */
    uint32_t LOCK15:1;         /*!< bit:     15  Lock Bit 15                        */
    uint32_t GPF16:1;          /*!< bit:     16  General Purpose Fuse 16            */
    uint32_t GPF17:1;          /*!< bit:     17  General Purpose Fuse 17            */
    uint32_t GPF18:1;          /*!< bit:     18  General Purpose Fuse 18            */
    uint32_t GPF19:1;          /*!< bit:     19  General Purpose Fuse 19            */
    uint32_t GPF20:1;          /*!< bit:     20  General Purpose Fuse 20            */
    uint32_t GPF21:1;          /*!< bit:     21  General Purpose Fuse 21            */
    uint32_t GPF22:1;          /*!< bit:     22  General Purpose Fuse 22            */
    uint32_t GPF23:1;          /*!< bit:     23  General Purpose Fuse 23            */
    uint32_t GPF24:1;          /*!< bit:     24  General Purpose Fuse 24            */
    uint32_t GPF25:1;          /*!< bit:     25  General Purpose Fuse 25            */
    uint32_t GPF26:1;          /*!< bit:     26  General Purpose Fuse 26            */
    uint32_t GPF27:1;          /*!< bit:     27  General Purpose Fuse 27            */
    uint32_t GPF28:1;          /*!< bit:     28  General Purpose Fuse 28            */
    uint32_t GPF29:1;          /*!< bit:     29  General Purpose Fuse 29            */
    uint32_t GPF30:1;          /*!< bit:     30  General Purpose Fuse 30            */
    uint32_t GPF31:1;          /*!< bit:     31  General Purpose Fuse 31            */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} FLASHCALW_FGPFRLO_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

